InformationRegisters/СведенияОбОтветственныхЛицах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбОтветственныхЛицах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
					<Comment>Ответственный за военно-учетную работу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Comment>Ответственный за охрану труда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьКассира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьРуководителяКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьОтветственногоЗаВУР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставительСФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СведенияОбОтветственныхЛицах/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает сведения об ответственных лицах организации.
//
// Параметры:
//	Организация		- СправочникСсылка.Организации - ссылка на организацию.
//	Сведения		- Строка - с идентификаторами, разделенными запятыми.
//	ДатаСведений	- Дата - дата получения сведений.
//
// Возвращаемое значение:
//	Структура - структура со свойствами, совпадающими с параметром «Сведения».
//		Допустимые идентификаторы запрашиваемых значений:
//				(совпадают с колонкой "Ключ" таблицы СведенияОбОтветственныхЛицах.ТаблицаОтветственныхЛицОрганизаций())
//				Руководитель						- Строка - руководитель организации.
//				ГлавныйБухгалтер					- Строка - главный бухгалтер организации.
//				Кассир								- Строка - кассир организации.
//				РуководительКадровойСлужбы			- Строка - Руководитель кадровой службы организации.
//				ОтветственныйЗаВУР 					- Строка - ответственный за военно-учетную работу.
//				ПредставительСФР 					- Строка - Уполномоченный представитель организации для СФР.
//				ОтветственныйЗаОхрануТруда			- Строка - ответственный за охрану труда.
//
Функция ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений = Неопределено) Экспорт 

	// Формирование структуры-результата
	
	ВозвращаемаяСтруктура = Новый Структура;
	
	ПоддерживаемыеИдентификаторы = ПоддерживаемыеИдентификаторыОтветственныхЛицОрганизаций();
	МассивИдентификаторов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Сведения, ",", Истина, Истина); 
	
	Для каждого ИдентификаторРоль Из МассивИдентификаторов Цикл
		Если ПоддерживаемыеИдентификаторы.Получить(ИдентификаторРоль) <> Неопределено Тогда
			ВозвращаемаяСтруктура.Вставить(ИдентификаторРоль);
		КонецЕсли;
	КонецЦикла; 
	
	// Получение сведений.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель КАК Руководитель,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	СведенияОбОтветственныхЛицахСрезПоследних.Кассир КАК Кассир,
		|	СведенияОбОтветственныхЛицахСрезПоследних.РуководительКадровойСлужбы КАК РуководительКадровойСлужбы,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР,
		|	ВЫБОР
		|		КОГДА СведенияОбОтветственныхЛицахСрезПоследних.ПредставительСФР <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|			ТОГДА СведенияОбОтветственныхЛицахСрезПоследних.ПредставительСФР
		|		КОГДА СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|			ТОГДА СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер
		|		ИНАЧЕ СведенияОбОтветственныхЛицахСрезПоследних.Руководитель
		|	КОНЕЦ КАК ПредставительСФР,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаОхрануТруда КАК ОтветственныйЗаОхрануТруда
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&Период, ) КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ?(ДатаСведений = Неопределено, ТекущаяДатаСеанса(), ДатаСведений));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСведений = РезультатЗапроса.Выгрузить();
	Если ТаблицаСведений.Количество() = 0 Тогда
		Возврат ВозвращаемаяСтруктура;
	КонецЕсли;
	
	СтруктураСведенийОбОтветственных = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаСведений[0]);
	ЗаполнитьЗначенияСвойств(ВозвращаемаяСтруктура, СтруктураСведенийОбОтветственных);
	
	Возврат ВозвращаемаяСтруктура;

КонецФункции

// Возвращает сведения об ответственных лицах организации.
//
// Параметры:
//		Организация - ссылка на организацию.
//		Сведения - строка с идентификаторами, разделенными запятыми.
//		ДатаСведений - дата получения сведений.
//
// Возвращаемое значение:
//		СтруктураДанных - структура со свойствами, совпадающими с параметром «Сведения».
//			Допустимые идентификаторы запрашиваемых значений:
//			Руководитель						- руководитель организации.
//			ДолжностьРуководителя				- должность руководителя.
//			ДолжностьРуководителяСтрокой		- представление должности руководителя.
//
//			ГлавныйБухгалтер					- главный бухгалтер организации.
//
//			Кассир								- кассир организации.
//			ДолжностьКассира					- должность кассира.
//			ДолжностьКассираСтрокой				- представление должности кассира.
//
//			РуководительКадровойСлужбы					- Руководитель кадровой службы организации.
//			ДолжностьРуководителяКадровойСлужбы			- должность руководителя кадровой службы организации.
//			ДолжностьРуководителяКадровойСлужбыСтрокой	- представление должности руководителя кадровой службы организации.
//
//			ОтветственныйЗаВУР 					- ответственный за военно-учетную работу.
//			ДолжностьОтветственногоЗаВУР 		- должность ответственного за военно-учетную работу.
//			ДолжностьОтветственногоЗаВУРСтрокой - представление должности ответственного за военно-учетную работу.
//
//			ПредставительСФР 					- Уполномоченный представитель организации для СФР.
//			ДолжностьПредставителяСФР 			- должность уполномоченного представителя организации для СФР.
//			ДолжностьПредставителяСФРСтрокой 	- представление должности уполномоченного представителя организации для СФР.
//
Функция СведенияОбОтветственныхЛицах(Организация, Сведения, ДатаСведений = Неопределено) Экспорт

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Период КАК Период
	|ПОМЕСТИТЬ ВТСведенияОбОтветственныхЛицахОтбор";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ?(ДатаСведений = Неопределено, ТекущаяДатаСеанса(), ДатаСведений));
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТСведенияОбОтветственныхЛицахОтбор");
	
	СоздатьВТСведенияОбОтветственныхЛицах(Запрос.МенеджерВременныхТаблиц, "ВТСведенияОбОтветственныхЛицахОтбор", Сведения, "ВТСведенияОбОтветственныхЛицахВнутренний");
	УдалитьВТ.Добавить("ВТСведенияОбОтветственныхЛицахВнутренний");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТСведенияОбОтветственныхЛицахВнутренний КАК СведенияОбОтветственныхЛицах";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	Если ТаблицаРезультат.Количество() > 0 Тогда
		ВозвращаемаяСтруктура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРезультат[0]);
	Иначе
		ВозвращаемаяСтруктура = ПустаяСтруктураПоТаблицеЗначений(ТаблицаРезультат);
	КонецЕсли;
	
	ВозвращаемаяСтруктура.Удалить("Организация");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ВозвращаемаяСтруктура;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сведения о том, сведения о каких ответственных лицах организаций можно получить в конкретной текущей конфигурации
// 
Функция ТаблицаОтветственныхЛицОрганизаций() Экспорт

	ТаблицаОтветственныхЛиц = Новый ТаблицаЗначений;
	
	ТаблицаОтветственныхЛиц.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	ТаблицаОтветственныхЛиц.Колонки.Добавить("Должность", Новый ОписаниеТипов("Строка"));
	ТаблицаОтветственныхЛиц.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	ТаблицаОтветственныхЛиц.Колонки.Добавить("ОснованиеПодписи", Новый ОписаниеТипов("Строка"));
	
	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"Руководитель", "ДолжностьРуководителя", "ДолжностьРуководителяСтрокой", "ОснованиеПодписиРуководителя");
		
	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"ГлавныйБухгалтер", "ДолжностьГлавногоБухгалтера", "ДолжностьГлавногоБухгалтераСтрокой", "ОснованиеПодписиГлавногоБухгалтера");
		
	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"Кассир", "ДолжностьКассира", "ДолжностьКассираСтрокой", "ОснованиеПодписиКассира");
		
	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"РуководительКадровойСлужбы", "ДолжностьРуководителяКадровойСлужбы", "ДолжностьРуководителяКадровойСлужбыСтрокой", "ОснованиеПодписиРуководителяКадровойСлужбы");

	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"ОтветственныйЗаВУР", "ДолжностьОтветственногоЗаВУР", "ДолжностьОтветственногоЗаВУРСтрокой", "ОснованиеПодписиОтветственногоЗаВУР");
	
	ДополнитьТаблицуОтветственныхЛиц(
		ТаблицаОтветственныхЛиц,
		"ПредставительСФР", "ДолжностьПредставителяСФР", "ДолжностьПредставителяСФРСтрокой", "ОснованиеПодписиПредставителяСФР");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульОхранаТруда = ОбщегоНазначения.ОбщийМодуль("ОхранаТруда");
		МодульОхранаТруда.ДополнитьТаблицуОтветственныхЛицОтветственнымЗаОхрануТруда(ТаблицаОтветственныхЛиц);
	КонецЕсли;
	
	Возврат ТаблицаОтветственныхЛиц;
	
КонецФункции

// Возвращает описание сведений об ответственных лицах организаций
// 
// Возвращаемое значение:
//		Соответствие - содержит структуры с описанием полей ответственных лиц.
//			* Ключ - имя роли ответственного лица (например "Руководитель")
//			* Значение - структура с описанием связанных  полей ответственного лица
//				- Должность - имя реквизита должности (например "ДолжностьРуководителя")
//				- НаименованиеДолжности - имя реквизита должности строкой (например "ДолжностьРуководителяСтрокой")
//				- ОснованиеПодписи - имя реквизита основания подписи (например "ОснованиеПодписиРуководителя")
//
Функция ПоддерживаемыеИдентификаторыОтветственныхЛицОрганизаций() Экспорт 

	ПоддерживаемыеИдентификаторы = Новый Соответствие;
	
	ТаблицаОтветственныхЛиц = ТаблицаОтветственныхЛицОрганизаций();
	Для каждого СтрокаОтветственногоЛица Из ТаблицаОтветственныхЛиц Цикл
		ОписаниеИдентификатора = Новый Структура("Должность, НаименованиеДолжности, ОснованиеПодписи");
		ЗаполнитьЗначенияСвойств(ОписаниеИдентификатора, СтрокаОтветственногоЛица);
		
		ПоддерживаемыеИдентификаторы.Вставить(СтрокаОтветственногоЛица.Ключ, ОписаниеИдентификатора);	
	КонецЦикла; 
	
	Возврат ПоддерживаемыеИдентификаторы;

КонецФункции

// Формирует временную таблицу ВТОтветственныеЛица, список организаций и периодов,
// по которым необходимо получить данные, берутся из временной таблицы в менеджере временных
// таблиц, переданном в качестве параметра. Временная таблица обязательно должна содержать
// колонки Организация и Период.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц с таблицей отборов.
//   ИмяТаблицыОтборов       - Строка - Имя таблицы, содержащей колонки Организация и Период.
//   Сведения                - Строка - Идентификаторы, разделенные запятыми.
//   ИмяСоздаваемойВТ        - Строка
//
Процедура СоздатьВТСведенияОбОтветственныхЛицах(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, Сведения, ИмяСоздаваемойВТ = "ВТСведенияОбОтветственныхЛицах") Экспорт 
	
	МассивСведений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(Сведения, " ",""), ",");	
	
	НаборНеобходимыхИдентификаторов = Новый Соответствие;
	ЗаполнитьНаборНеобходимыхИдентификаторовПоМассивуСведений(НаборНеобходимыхИдентификаторов, МассивСведений);
	
	МассивРолей = ОбщегоНазначения.ВыгрузитьКолонку(НаборНеобходимыхИдентификаторов, "Ключ");
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяТаблицыОтборов, "Организация,Период");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СведенияОбОтветственныхЛицах",
		МенеджерВременныхТаблиц,
		Ложь,
		ОписаниеФильтра,
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез(),
		"ВТОтветственныеЛицаВнутренний");
		
	УдалитьВТ.Добавить("ВТОтветственныеЛицаВнутренний");
	
	СоздатьВТСведенияОбОтветственныхЛицахПоРолям(
		Запрос.МенеджерВременныхТаблиц, МассивРолей, "ВТОтветственныеЛицаВнутренний");
		
	УдалитьВТ.Добавить("ВТСведенияОбОтветственныхЛицахПоРолям");
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтветственныеЛица.Организация КАК Организация,
		|	ОтветственныеЛица.Период КАК Период,";
		
	Для каждого ИдентификаторРоли Из НаборНеобходимыхИдентификаторов Цикл
		ПсевдонимСведений = ИдентификаторРоли.Ключ + "Сведения";
		ОписаниеПолейРоли = ИдентификаторРоли.Значение;
		
		МассивСтрок = Новый Массив;
		
		Если МассивСведений.Найти(ИдентификаторРоли.Ключ) <> Неопределено Тогда
			Если ИдентификаторРоли.Ключ = "ПредставительСФР" Тогда
				ФрагментЗапросаФизлица = 
				"ВЫБОР
				|		КОГДА ОтветственныеЛица.#КлючРоли <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ОтветственныеЛица.#КлючРоли
				|		КОГДА ОтветственныеЛица.ГлавныйБухгалтер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ОтветственныеЛица.ГлавныйБухгалтер
				|		ИНАЧЕ ОтветственныеЛица.Руководитель
				|	КОНЕЦ КАК #КлючРоли";
			Иначе
				ФрагментЗапросаФизлица = "ОтветственныеЛица.#КлючРоли КАК #КлючРоли";
			КонецЕсли;
			МассивСтрок.Добавить(СтрЗаменить(ФрагментЗапросаФизлица, "#КлючРоли", ИдентификаторРоли.Ключ));
		КонецЕсли;
		Если МассивСведений.Найти(ОписаниеПолейРоли.Должность) <> Неопределено Тогда
			МассивСтрок.Добавить(ПсевдонимСведений + ".Должность КАК" + " " + ОписаниеПолейРоли.Должность);
		КонецЕсли;
		Если МассивСведений.Найти(ОписаниеПолейРоли.НаименованиеДолжности) <> Неопределено Тогда
			МассивСтрок.Добавить(ПсевдонимСведений + ".Должность.Наименование КАК" + " " + ОписаниеПолейРоли.НаименованиеДолжности);
		КонецЕсли;
		Если МассивСведений.Найти(ОписаниеПолейРоли.ОснованиеПодписи) <> Неопределено Тогда
			МассивСтрок.Добавить(ПсевдонимСведений + ".ОснованиеПодписи КАК" + " " + ОписаниеПолейРоли.ОснованиеПодписи);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ?(МассивРолей.Найти(ИдентификаторРоли.Ключ) = 0, "", ",") + СтрСоединить(МассивСтрок, ",");
	КонецЦикла;
	
	ТестПоместитьИз = 
		"ПОМЕСТИТЬ #ВТСведенияОбОтветственныхЛицах
		|ИЗ
		|	ВТОтветственныеЛицаВнутренний КАК ОтветственныеЛица";
	
	Запрос.Текст = Запрос.Текст + " " + СтрЗаменить(ТестПоместитьИз, "#ВТСведенияОбОтветственныхЛицах", ИмяСоздаваемойВТ);
	
	Для каждого ИдентификаторРоли Из НаборНеобходимыхИдентификаторов Цикл
		ПсевдонимСведений = ИдентификаторРоли.Ключ + "Сведения";
		
		ТекстЗапроса =
		"		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОбОтветственныхЛицахПоРолям КАК #ПсевдонимСведений
		|		ПО ОтветственныеЛица.Организация = #ПсевдонимСведений.Организация
		|			И ОтветственныеЛица.#КлючРоли = #ПсевдонимСведений.ФизическоеЛицо";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПсевдонимСведений", ПсевдонимСведений);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#КлючРоли", ИдентификаторРоли.Ключ);
		
		Запрос.Текст = Запрос.Текст + ТекстЗапроса;
	КонецЦикла;
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
		
КонецПроцедуры

// Заполняет переданную таблицу "СведенияОбОтветственных" данными из сведений об ответственных лицах,
// по переданному списку физических лиц.
//
// Параметры:
//		СписокФизическихЛиц - массив - содержит физические лица.
//		СведенияОбОтветственных - Таблица значений - заполняемая сведениями таблица.
//
Процедура ЗаполнитьСведенияОбОтветственныхЛицах(СписокФизическихЛиц, СведенияОбОтветственных) Экспорт
	
	Если СписокФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	
	Запрос.УстановитьПараметр("РольРуководитель", 				НСтр("ru='Руководитель'"));
	Запрос.УстановитьПараметр("РольГлавныйБухгалтер", 			НСтр("ru='Главный бухгалтер'"));
	Запрос.УстановитьПараметр("РольКассир",						НСтр("ru='Кассир'"));
	Запрос.УстановитьПараметр("РольРуководительКадровойСлужбы", НСтр("ru='Руководитель кадровой службы'"));
	Запрос.УстановитьПараметр("РольОтветственныйЗаВУР", 		НСтр("ru='Ответственный за ВУР'"));
	Запрос.УстановитьПараметр("РольПредставительСФР", 			НСтр("ru='Уполномоченный представитель для СФР'"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация КАК Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель КАК Руководитель,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	СведенияОбОтветственныхЛицахСрезПоследних.Кассир КАК Кассир,
		|	СведенияОбОтветственныхЛицахСрезПоследних.РуководительКадровойСлужбы КАК РуководительКадровойСлужбы,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР,
		|	ВЫБОР
		|		КОГДА СведенияОбОтветственныхЛицахСрезПоследних.ПредставительСФР <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|			ТОГДА СведенияОбОтветственныхЛицахСрезПоследних.ПредставительСФР
		|		КОГДА СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|			ТОГДА СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер
		|		ИНАЧЕ СведенияОбОтветственныхЛицахСрезПоследних.Руководитель
		|	КОНЕЦ КАК ПредставительСФР
		|ПОМЕСТИТЬ ВТСведенияОбОтветственныхЛицах
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&ТекущийПериод, ) КАК СведенияОбОтветственныхЛицахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация КАК Организация,
		|	СведенияОбОтветственныхЛицах.Руководитель КАК ФизическоеЛицо,
		|	&РольРуководитель КАК РольОтветственногоЛица
		|ПОМЕСТИТЬ ВТОтветственныеЛица
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.Руководитель В(&СписокФизическихЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация,
		|	СведенияОбОтветственныхЛицах.ГлавныйБухгалтер,
		|	&РольГлавныйБухгалтер
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.ГлавныйБухгалтер В(&СписокФизическихЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация,
		|	СведенияОбОтветственныхЛицах.Кассир,
		|	&РольКассир
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.Кассир В(&СписокФизическихЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация,
		|	СведенияОбОтветственныхЛицах.РуководительКадровойСлужбы,
		|	&РольРуководительКадровойСлужбы
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.РуководительКадровойСлужбы В(&СписокФизическихЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация,
		|	СведенияОбОтветственныхЛицах.ОтветственныйЗаВУР,
		|	&РольОтветственныйЗаВУР
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.ОтветственныйЗаВУР В(&СписокФизическихЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицах.Организация,
		|	СведенияОбОтветственныхЛицах.ПредставительСФР,
		|	&РольПредставительСФР
		|ИЗ
		|	ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах
		|ГДЕ
		|	СведенияОбОтветственныхЛицах.ГлавныйБухгалтер В(&СписокФизическихЛиц)";
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТСведенияОбОтветственныхЛицах");
	УдалитьВТ.Добавить("ВТОтветственныеЛица");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульОхранаТруда = ОбщегоНазначения.ОбщийМодуль("ОхранаТруда");
		МодульОхранаТруда.ДополнитьВТОтветственныхЛицОтветственнымиЗаОхрануТруда(Запрос.МенеджерВременныхТаблиц, СписокФизическихЛиц);
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ТекущийПериод КАК Период,
		|	ВТОтветственныеЛица.Организация КАК Организация,
		|	ВТОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТОрганизацииФизическиеЛица
		|ИЗ
		|	ВТОтветственныеЛица КАК ВТОтветственныеЛица";
		
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТОрганизацииФизическиеЛица");
	
	ПодписиДокументов.СоздатьВТОснованияПолномочийФизическихЛиц(Запрос.МенеджерВременныхТаблиц);
	УдалитьВТ.Добавить("ВТОснованияПолномочийФизическихЛиц");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ответственные.Организация КАК СтруктурнаяЕдиница,
		|	Ответственные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Ответственные.РольОтветственногоЛица КАК РольОтветственногоЛица,
		|	ДолжностиФизическихЛиц.Должность КАК Должность,
		|	ВЫБОР
		|		КОГДА ДолжностиФизическихЛиц.Должность ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ДолжностиФизическихЛиц.Должность)
		|	КОНЕЦ КАК ПредставлениеДолжности
		|ИЗ
		|	ВТОтветственныеЛица КАК Ответственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияПолномочийФизическихЛиц КАК ДолжностиФизическихЛиц
		|		ПО Ответственные.Организация = ДолжностиФизическихЛиц.Организация
		|			И Ответственные.ФизическоеЛицо = ДолжностиФизическихЛиц.ФизическоеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаСведений = СведенияОбОтветственных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСведений, Выборка, "СтруктурнаяЕдиница,ФизическоеЛицо");
		НоваяСтрокаСведений.ПредставлениеДолжности = Выборка.РольОтветственногоЛица;
		Если Не ПустаяСтрока(Выборка.ПредставлениеДолжности) Тогда
			НоваяСтрокаСведений.ПредставлениеДолжности = НоваяСтрокаСведений.ПредставлениеДолжности
			+ " (" + Выборка.ПредставлениеДолжности + ")";
		КонецЕсли;
		
	КонецЦикла;
		
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

// См. обработчик обновления ОснованияПолномочийОтветственныхЛиц.ЗаполнитьДолжностиФизическихЛицИзОтветственныхЛиц().
//
Процедура СоздатьВТУдаленныеДолжностиОтветственныхЛицОрганизаций(МенеджерВременныхТаблиц) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация КАК Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель КАК ФизическоеЛицо,
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьРуководителя КАК Должность
		|ПОМЕСТИТЬ ВТВсеДолжности
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьРуководителя <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.Кассир,
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьКассира
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьКассира <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.РуководительКадровойСлужбы,
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьРуководителяКадровойСлужбы
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьРуководителяКадровойСлужбы <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаВУР,
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьОтветственногоЗаВУР
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьОтветственногоЗаВУР <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбОтветственныхЛицахСрезПоследних.Организация,
		|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаОхрануТруда,
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьОтветственногоЗаОхрануТруда
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних
		|ГДЕ
		|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьОтветственногоЗаОхрануТруда <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсеДолжности.Организация КАК Организация,
		|	ВТВсеДолжности.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ВТВсеДолжности.Должность) КАК Должность
		|ПОМЕСТИТЬ ВТУдаленныеДолжностиОтветственныхЛицОрганизаций
		|ИЗ
		|	ВТВсеДолжности КАК ВТВсеДолжности
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсеДолжности.Организация,
		|	ВТВсеДолжности.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВсеДолжности";
	
	Запрос.Выполнить();

КонецПроцедуры

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОбОтветственныхЛицах, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьТаблицуОтветственныхЛиц(ТаблицаОтветственныхЛиц, Ключ, Должность, НаименованиеДолжности, ОснованиеПодписи);

	НоваяСтрока = ТаблицаОтветственныхЛиц.Добавить();
	
	НоваяСтрока.Ключ = Ключ;
	НоваяСтрока.Должность = Должность;
	НоваяСтрока.НаименованиеДолжности = НаименованиеДолжности;
	НоваяСтрока.ОснованиеПодписи = ОснованиеПодписи;

КонецПроцедуры

Процедура ЗаполнитьНаборНеобходимыхИдентификаторовПоМассивуСведений(НаборНеобходимыхИдентификаторов, МассивСведений)

	ПоддерживаемыеИдентификаторы = ПоддерживаемыеИдентификаторыОтветственныхЛицОрганизаций();
	Для каждого ИдентификаторРоли Из ПоддерживаемыеИдентификаторы Цикл
		// Ищем в роли
		Если МассивСведений.Найти(ИдентификаторРоли.Ключ) <> Неопределено Тогда
			НаборНеобходимыхИдентификаторов.Вставить(ИдентификаторРоли.Ключ, ИдентификаторРоли.Значение);
		КонецЕсли;
		
		РеквизитыРоли = ИдентификаторРоли.Значение;
		
		Если МассивСведений.Найти(РеквизитыРоли.Должность) <> Неопределено Тогда
			НаборНеобходимыхИдентификаторов.Вставить(ИдентификаторРоли.Ключ, ИдентификаторРоли.Значение);
		КонецЕсли;
		Если МассивСведений.Найти(РеквизитыРоли.НаименованиеДолжности) <> Неопределено Тогда
			НаборНеобходимыхИдентификаторов.Вставить(ИдентификаторРоли.Ключ, ИдентификаторРоли.Значение);
		КонецЕсли;
		Если МассивСведений.Найти(РеквизитыРоли.ОснованиеПодписи) <> Неопределено Тогда
			НаборНеобходимыхИдентификаторов.Вставить(ИдентификаторРоли.Ключ, ИдентификаторРоли.Значение);
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

Процедура СоздатьВТСведенияОбОтветственныхЛицахПоРолям(МенеджерВременныхТаблиц, МассивРолей, ИмяТаблицыОтборов)
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаОтветственныхПоРолямПоСтрокеСведений(МассивРолей, ИмяТаблицыОтборов);
	
	ТекстТаблицыОтбора = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОтветственныеПоРолям.Организация КАК Организация,
		|	ВТОтветственныеПоРолям.Период КАК Период,
		|	ВТОтветственныеПоРолям.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаОтборВнутренний
		|ИЗ
		|	ВТОтветственныеПоРолям КАК ВТОтветственныеПоРолям";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстТаблицыОтбора);
	
	Запрос.Выполнить();

	УдалитьВТ.Добавить("ВТОтветственныеПоРолям");
	УдалитьВТ.Добавить("ВТФизическиеЛицаОтборВнутренний");
	
	ПодписиДокументов.СоздатьВТОснованияПолномочийФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛицаОтборВнутренний");
	УдалитьВТ.Добавить("ВТОснованияПолномочийФизическихЛиц");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ответственные.Организация КАК Организация,
		|	Ответственные.Период КАК Период,
		|	Ответственные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Ответственные.РольОтветственногоЛица КАК РольОтветственногоЛица
		|ПОМЕСТИТЬ ВТОтветственныеПоРолямБезОснованияПолномочий
		|ИЗ
		|	ВТОтветственныеПоРолям КАК Ответственные
		|ГДЕ
		|	НЕ (Ответственные.Организация, Ответственные.ФизическоеЛицо) В
		|				(ВЫБРАТЬ
		|					ОснованияПолномочий.Организация,
		|					ОснованияПолномочий.ФизическоеЛицо
		|				ИЗ
		|					ВТОснованияПолномочийФизическихЛиц КАК ОснованияПолномочий)";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТОтветственныеПоРолямБезОснованияПолномочий");
	
	СтандартнаяОбработка = Истина;
	Если ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТОтветственныеПоРолямБезОснованияПолномочий") Тогда
		СоздатьВТКадровыеДанныеСотрудниковБезОснованияПолномочий(Запрос, СтандартнаяОбработка, УдалитьВТ);
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда	
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Ответственные.Организация КАК Организация,
			|	Ответственные.Период КАК Период,
			|	Ответственные.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Ответственные.РольОтветственногоЛица КАК РольОтветственногоЛица,
			|	ЕСТЬNULL(ОснованияПолномочий.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
			|	ЕСТЬNULL(ОснованияПолномочий.ОснованиеПодписи, """") КАК ОснованиеПодписи
			|ПОМЕСТИТЬ ВТСведенияОбОтветственныхЛицахПоРолям
			|ИЗ
			|	ВТОтветственныеПоРолям КАК Ответственные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияПолномочийФизическихЛиц КАК ОснованияПолномочий
			|		ПО Ответственные.Организация = ОснованияПолномочий.Организация
			|			И Ответственные.ФизическоеЛицо = ОснованияПолномочий.ФизическоеЛицо";
	Иначе	
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Ответственные.Организация КАК Организация,
			|	Ответственные.Период КАК Период,
			|	Ответственные.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Ответственные.РольОтветственногоЛица КАК РольОтветственногоЛица,
			|	ЕСТЬNULL(ОснованияПолномочий.Должность, ЕСТЬNULL(КадровыеДанныеСотрудников.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка))) КАК Должность,
			|	ЕСТЬNULL(ОснованияПолномочий.ОснованиеПодписи, """") КАК ОснованиеПодписи
			|ПОМЕСТИТЬ ВТСведенияОбОтветственныхЛицахПоРолям
			|ИЗ
			|	ВТОтветственныеПоРолям КАК Ответственные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияПолномочийФизическихЛиц КАК ОснованияПолномочий
			|		ПО Ответственные.Организация = ОснованияПолномочий.Организация
			|			И Ответственные.ФизическоеЛицо = ОснованияПолномочий.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковБезОснованияПолномочий КАК КадровыеДанныеСотрудников
			|		ПО Ответственные.Организация = КадровыеДанныеСотрудников.Организация
			|			И Ответственные.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо";
	КонецЕсли;
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

Процедура СоздатьВТКадровыеДанныеСотрудниковБезОснованияПолномочий(Запрос, СтандартнаяОбработка, УдалитьВТ)
	
	ДатаАктуальности = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ответственные.Организация КАК Организация,
		|	Ответственные.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТОтветственныеПоРолямБезОснованияПолномочий КАК Ответственные";
	
	ОтветственныеБезОснований = Запрос.Выполнить().Выгрузить();
	
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Истина,
		ОтветственныеБезОснований.ВыгрузитьКолонку("ФизическоеЛицо"), ОтветственныеБезОснований.ВыгрузитьКолонку("Организация"), ДатаАктуальности);
	УдалитьВТ.Добавить("ВТОсновныеСотрудникиФизическихЛиц");
	
	Если ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТОсновныеСотрудникиФизическихЛиц") Тогда
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Сотрудники.Сотрудник КАК Сотрудник,
			|	&ДатаАктуальности КАК Период
			|ПОМЕСТИТЬ ВТСотрудники
			|ИЗ
			|	ВТОсновныеСотрудникиФизическихЛиц КАК Сотрудники"; 
		Запрос.Выполнить();
		УдалитьВТ.Добавить("ВТСотрудники");
		
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
		ОписательВременныхТаблиц.ИмяВТКадровыеДанныеСотрудников = "ВТКадровыеДанныеСотрудниковБезОснованияПолномочий";
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "Организация, Должность");
		УдалитьВТ.Добавить("ВТКадровыеДанныеСотрудниковБезОснованияПолномочий");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

Функция ТекстЗапросаОтветственныхПоРолямПоСтрокеСведений(МассивРолей, ИмяТаблицыИсточника = "ВТСведенияОбОтветственныхЛицах", ИмяСоздаваемойВТ = "ВТОтветственныеПоРолям")
	
	ТекстыЗапросов = Новый Массив;
	ПС = Символы.ПС;
	ПСТаб = Символы.ПС + Символы.Таб;
	
	Для каждого КлючРоли Из МассивРолей Цикл
		МассивСтрокЗапроса = Новый Массив;
		
		ТекстЗапроса = "ВЫБРАТЬ";
		
		Если КлючРоли = "ПредставительСФР" Тогда
			ФрагментЗапросаФизлица = 
			"ВЫБОР
			|		КОГДА СведенияОбОтветственныхЛицах.#КлючРоли <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|			ТОГДА СведенияОбОтветственныхЛицах.#КлючРоли
			|		КОГДА СведенияОбОтветственныхЛицах.ГлавныйБухгалтер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|			ТОГДА СведенияОбОтветственныхЛицах.ГлавныйБухгалтер
			|		ИНАЧЕ СведенияОбОтветственныхЛицах.Руководитель
			|	КОНЕЦ КАК ФизическоеЛицо";
		Иначе
			ФрагментЗапросаФизлица = "СведенияОбОтветственныхЛицах.#КлючРоли КАК ФизическоеЛицо";
		КонецЕсли;
		
		МассивСтрокЗапроса.Добавить("СведенияОбОтветственныхЛицах.Организация КАК Организация");
		МассивСтрокЗапроса.Добавить("СведенияОбОтветственныхЛицах.Период КАК Период");
		МассивСтрокЗапроса.Добавить(СтрЗаменить(ФрагментЗапросаФизлица, "#КлючРоли", КлючРоли));
		МассивСтрокЗапроса.Добавить(СтрЗаменить("""#КлючРоли"" КАК РольОтветственногоЛица", "#КлючРоли", КлючРоли));
		
		ТекстЗапроса = ТекстЗапроса + ПСТаб + СтрСоединить(МассивСтрокЗапроса, "," + ПСТаб);
		
		Если ТекстыЗапросов.Количество() = 0 Тогда
			ТекстЗапроса = ТекстЗапроса + ПС + СтрЗаменить("ПОМЕСТИТЬ #ВТОтветственныеПоРолям", "#ВТОтветственныеПоРолям", ИмяСоздаваемойВТ);
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ПС + СтрЗаменить("ИЗ #ВТСведенияОбОтветственныхЛицах КАК СведенияОбОтветственныхЛицах", "#ВТСведенияОбОтветственныхЛицах", ИмяТаблицыИсточника);
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	Возврат СтрСоединить(ТекстыЗапросов, ПС + ПС + "ОБЪЕДИНИТЬ ВСЕ" + ПС + ПС);

КонецФункции

Функция ПустаяСтруктураПоТаблицеЗначений(ТаблицаЗначений)

	МассивСтрок = Новый Массив;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивСтрок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Возврат Новый Структура(СтрСоединить(МассивСтрок, ","));

КонецФункции

#КонецОбласти
